In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [6]:
df = pd.read_csv("ecommerce_company_dataset.csv")

In [7]:
df.head()

,OrderID,OrderDate,CustomerID,Region,Category,Product,Quantity,Price,Cost,Revenue,Profit,Returned
0,1,2025-07-01 11:20:47.314623,1860,South,Sports,Dumbbell,2,22480.29,11577.63,44960.58,21805.32,No
1,2,2025-07-05 11:20:47.314623,4772,South,Clothing,Shirt,3,26531.49,20644.41,79594.47,17661.24,No
2,3,2025-01-27 11:20:47.314623,4092,West,Electronics,Laptop,3,41385.96,25009.20,124157.88,49130.28,No
3,4,2024-08-19 11:20:47.314623,1466,East,Clothing,Shoes,1,20803.90,13609.92,20803.90,7193.98,Yes
4,5,2024-03-24 11:20:47.314623,5426,West,Sports,Treadmill,3,11657.87,7263.47,34973.61,13183.20,No

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25000 entries, 0 to 24999
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   OrderID     25000 non-null  int64
 1   OrderDate   25000 non-null  object
 2   CustomerID  25000 non-null  int64
 3   Region      25000 non-null  object
 4   Category    25000 non-null  object
 5   Product     25000 non-null  object
 6   Quantity    25000 non-null  int64
 7   Price       25000 non-null  float64
 8   Cost        25000 non-null  float64
 9   Revenue     25000 non-null  float64
 10  Profit      25000 non-null  float64
 11  Returned    25000 non-null  object
dtypes: float64(4), int64(3), object(5)
memory usage: 2.3+ MB

In [10]:
for column in df.columns:
    if df[column].nunique()<20:
        print(df[column].value_counts())
        print('_'*40)

Region
West     6306
South    6251
East     6232
North    6211
Name: count, dtype: int64
________________________________________
Category
Beauty         5069
Sports         5047
Clothing       5000
Electronics    4947
Home           4937
Name: count, dtype: int64
________________________________________
Quantity
1    6317
2    6274
4    6232
3    6177
Name: count, dtype: int64
________________________________________
Returned
No     21221
Yes     3779
Name: count, dtype: int64
________________________________________

In [11]:
df.shape

(25000, 12)

In [12]:
df.isna().sum()

OrderID       0
OrderDate     0
CustomerID    0
Region        0
Category      0
Product       0
Quantity      0
Price         0
Cost          0
Revenue       0
Profit        0
Returned      0
dtype: int64

In [14]:
df.duplicated().sum()

np.int64(0)

In [16]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
OrderID,25000.0,12500.500000,7217.022701,1.00,6250.7500,12500.500,18750.2500,25000.00
CustomerID,25000.0,3494.012720,1439.031508,1000.00,2247.0000,3498.500,4727.0000,5999.00
Quantity,25000.0,2.492960,1.119786,1.00,1.0000,2.000,3.0000,4.00
Price,25000.0,25157.411438,14316.000702,200.42,12839.3675,25159.660,37648.4100,49997.00
Cost,25000.0,17592.549624,10551.535693,102.23,8689.7200,17150.355,25556.9225,44701.82
Revenue,25000.0,62763.326698,48209.708894,202.33,24428.7300,48352.750,91946.8950,199924.08
Profit,25000.0,18886.492607,17077.744706,38.34,6039.4300,13628.020,26911.1800,97588.72

In [17]:
df.head()

,OrderID,OrderDate,CustomerID,Region,Category,Product,Quantity,Price,Cost,Revenue,Profit,Returned
0,1,2025-07-01 11:20:47.314623,1860,South,Sports,Dumbbell,2,22480.29,11577.63,44960.58,21805.32,No
1,2,2025-07-05 11:20:47.314623,4772,South,Clothing,Shirt,3,26531.49,20644.41,79594.47,17661.24,No
2,3,2025-01-27 11:20:47.314623,4092,West,Electronics,Laptop,3,41385.96,25009.20,124157.88,49130.28,No
3,4,2024-08-19 11:20:47.314623,1466,East,Clothing,Shoes,1,20803.90,13609.92,20803.90,7193.98,Yes
4,5,2024-03-24 11:20:47.314623,5426,West,Sports,Treadmill,3,11657.87,7263.47,34973.61,13183.20,No

Total Revenue

In [23]:
total_revenue = df['Revenue'].sum()

print(total_revenue)

1569083167.44

Total Profit

In [24]:
total_profit = df['Profit'].sum()

print(total_profit)

472162315.17

Profit Margin %

In [28]:
profit_magrin = (total_profit/total_revenue)*100

print(round(profit_magrin,2))

30.09

Return Rate %

In [29]:
total_order = len(df)

returned_orders = df[df['Returned']=='Yes'].shape[0]

return_rate = (returned_orders/total_order)*100

print(return_rate)

15.116

In [30]:
unique_customer = df['CustomerID'].nunique()

print(unique_customer)

4970

The company currently maintains a strong 30% profit margin; however, a 15% return rate represents a structural operational risk. While profitability is stable now, sustained or increasing returns could significantly erode margins in future periods.

In [46]:
df.head()

,OrderID,OrderDate,CustomerID,Region,Category,Product,Quantity,Price,Cost,Revenue,Profit,Returned
0,1,2025-07-01 11:20:47.314623,1860,South,Sports,Dumbbell,2,22480.29,11577.63,44960.58,21805.32,No
1,2,2025-07-05 11:20:47.314623,4772,South,Clothing,Shirt,3,26531.49,20644.41,79594.47,17661.24,No
2,3,2025-01-27 11:20:47.314623,4092,West,Electronics,Laptop,3,41385.96,25009.20,124157.88,49130.28,No
3,4,2024-08-19 11:20:47.314623,1466,East,Clothing,Shoes,1,20803.90,13609.92,20803.90,7193.98,Yes
4,5,2024-03-24 11:20:47.314623,5426,West,Sports,Treadmill,3,11657.87,7263.47,34973.61,13183.20,No

Revenue & Profit by Category

In [50]:
category_summary = df.groupby('Category').agg({
    'Profit':'sum',
    'Revenue':'sum',
    'OrderID':'count'
}).reset_index()

category_summary['profit_magrin_%'] = (category_summary['Profit']/category_summary['Revenue'])*100

category_summary

      Category       Profit       Revenue  OrderID  profit_magrin_%
0       Beauty  93890141.83  3.154648e+08     5069        29.762475
1     Clothing  95423045.77  3.139734e+08     5000        30.392077
2  Electronics  94284531.59  3.121364e+08     4947        30.206192
3         Home  92760353.72  3.095518e+08     4937        29.966019
4       Sports  95804242.26  3.179567e+08     5047        30.131227

Return Rate by Category

In [51]:
return_by_category = df.groupby('Category').agg(
    total_orders = ('OrderID','count'),
    return_orders = ('Returned',lambda x:(x=='Yes').sum())
    ).reset_index()

return_by_category['Return_Rate_%'] = (return_by_category['return_orders']/return_by_category['total_orders'])*100

return_by_category

      Category  total_orders  return_orders  Return_Rate_%
0       Beauty          5069            770      15.190373
1     Clothing          5000            747      14.940000
2  Electronics          4947            769      15.544775
3         Home          4937            735      14.887584
4       Sports          5047            758      15.018823

Combined Analysis

In [53]:
combine_category_summery = category_summary.merge(return_by_category,on='Category')

combine_category_summery

,Category,Profit,Revenue,OrderID,profit_magrin_%,total_orders,return_orders,Return_Rate_%
0,Beauty,93890141.83,3.154648e+08,5069,29.762475,5069,770,15.190373
1,Clothing,95423045.77,3.139734e+08,5000,30.392077,5000,747,14.940000
2,Electronics,94284531.59,3.121364e+08,4947,30.206192,4947,769,15.544775
3,Home,92760353.72,3.095518e+08,4937,29.966019,4937,735,14.887584
4,Sports,95804242.26,3.179567e+08,5047,30.131227,5047,758,15.018823

Revenue is almost evenly distributed. 
Profit margin are very consistent. 
Return Rate is also consistent.

There is NO single problematic category.

Time Series Analysis

In [54]:
df.head()

,OrderID,OrderDate,CustomerID,Region,Category,Product,Quantity,Price,Cost,Revenue,Profit,Returned
0,1,2025-07-01 11:20:47.314623,1860,South,Sports,Dumbbell,2,22480.29,11577.63,44960.58,21805.32,No
1,2,2025-07-05 11:20:47.314623,4772,South,Clothing,Shirt,3,26531.49,20644.41,79594.47,17661.24,No
2,3,2025-01-27 11:20:47.314623,4092,West,Electronics,Laptop,3,41385.96,25009.20,124157.88,49130.28,No
3,4,2024-08-19 11:20:47.314623,1466,East,Clothing,Shoes,1,20803.90,13609.92,20803.90,7193.98,Yes
4,5,2024-03-24 11:20:47.314623,5426,West,Sports,Treadmill,3,11657.87,7263.47,34973.61,13183.20,No

In [55]:
df['OrderDate'] = pd.to_datetime(df['OrderDate'])

In [56]:
df['YearMonth'] = df['OrderDate'].dt.to_period('M')

In [57]:
df.head()

,OrderID,OrderDate,CustomerID,Region,Category,Product,Quantity,Price,Cost,Revenue,Profit,Returned,YearMonth
0,1,2025-07-01 11:20:47.314623,1860,South,Sports,Dumbbell,2,22480.29,11577.63,44960.58,21805.32,No,2025-07
1,2,2025-07-05 11:20:47.314623,4772,South,Clothing,Shirt,3,26531.49,20644.41,79594.47,17661.24,No,2025-07
2,3,2025-01-27 11:20:47.314623,4092,West,Electronics,Laptop,3,41385.96,25009.20,124157.88,49130.28,No,2025-01
3,4,2024-08-19 11:20:47.314623,1466,East,Clothing,Shoes,1,20803.90,13609.92,20803.90,7193.98,Yes,2024-08
4,5,2024-03-24 11:20:47.314623,5426,West,Sports,Treadmill,3,11657.87,7263.47,34973.61,13183.20,No,2024-03

In [ ]:
monthly_trend = df.groupby('YearMonth').agg(
    total_revenue = ('Revenue','sum'),
    Total_profit = ('Profit','sum'),
    Total_Orders = ('OrderID','count'),
    returned_orders = ('Returned',lambda x:(x=='Yes').sum())
).reset_index()

monthly_trend

   YearMonth  total_revenue  Total_profit  Total_Orders  returned_orders
0    2024-02     8721347.72    2719189.08           137               19
1    2024-03    70008702.75   21434620.19          1106              179
2    2024-04    60438848.21   18252749.99          1009              147
3    2024-05    66715645.40   19533108.47          1048              161
4    2024-06    62842075.37   18169464.32          1001              151
5    2024-07    65322536.39   19452635.08          1026              148
6    2024-08    64256776.07   18942196.55          1024              160
7    2024-09    65263714.64   19914382.42          1063              162
8    2024-10    69661976.31   21168750.16          1067              162
9    2024-11    64337166.88   19099425.26          1042              154
10   2024-12    66837270.83   20554451.45          1076              147
11   2025-01    67050800.04   20199776.71          1056              160
12   2025-02    61176012.86   18784849.13           952              154
13   2025-03    71206967.81   21693655.23          1120              173
14   2025-04    61162666.68   18761203.33           980              156
15   2025-05    61362665.94   18210766.57          1027              170
16   2025-06    61057265.94   18130711.54           988              119
17   2025-07    72751860.44   21605080.45          1146              178
18   2025-08    64327175.72   19252087.17          1036              154
19   2025-09    67027939.17   20699169.13          1055              150
20   2025-10    65744149.38   19819520.33          1031              153
21   2025-11    64885266.11   19272407.36          1049              154
22   2025-12    66156471.40   20086338.17          1076              169
23   2026-01    65513514.51   19763755.52          1041              165
24   2026-02    55254350.87   16642021.56           844              134

In [59]:
monthly_trend['Profit_Margin_%'] = (monthly_trend['Total_profit']/monthly_trend['total_revenue'])*100

monthly_trend['Return_Rate_%'] = (monthly_trend['returned_orders']/monthly_trend['Total_Orders']) * 100

In [62]:
monthly_trend

,YearMonth,total_revenue,Total_profit,Total_Orders,returned_orders,Profit_Margin_%,Return_Rate_%
0,2024-02,8721347.72,2719189.08,137,19,31.178542,13.868613
1,2024-03,70008702.75,21434620.19,1106,179,30.617080,16.184448
2,2024-04,60438848.21,18252749.99,1009,147,30.200360,14.568880
3,2024-05,66715645.40,19533108.47,1048,161,29.278153,15.362595
4,2024-06,62842075.37,18169464.32,1001,151,28.912897,15.084915
5,2024-07,65322536.39,19452635.08,1026,148,29.779363,14.424951
6,2024-08,64256776.07,18942196.55,1024,160,29.478909,15.625000
7,2024-09,65263714.64,19914382.42,1063,162,30.513713,15.239887
8,2024-10,69661976.31,21168750.16,1067,162,30.387812,15.182755
9,2024-11,64337166.88,19099425.26,1042,154,29.686457,14.779271
10,2024-12,66837270.83,20554451.45,1076,147,30.752978,13.661710
11,2025-01,67050800.04,20199776.71,1056,160,30.126079,15.151515
12,2025-02,61176012.86,18784849.13,952,154,30.706233,16.176471
13,2025-03,71206967.81,21693655.23,1120,173,30.465635,15.446429
14,2025-04,61162666.68,18761203.33,980,156,30.674273,15.918367
15,2025-05,61362665.94,18210766.57,1027,170,29.677274,16.553067
16,2025-06,61057265.94,18130711.54,988,119,29.694601,12.044534
17,2025-07,72751860.44,21605080.45,1146,178,29.696946,15.532286
18,2025-08,64327175.72,19252087.17,1036,154,29.928389,14.864865
19,2025-09,67027939.17,20699169.13,1055,150,30.881405,14.218009
20,2025-10,65744149.38,19819520.33,1031,153,30.146440,14.839961
21,2025-11,64885266.11,19272407.36,1049,154,29.702286,14.680648
22,2025-12,66156471.40,20086338.17,1076,169,30.361864,15.706320
23,2026-01,65513514.51,19763755.52,1041,165,30.167448,15.850144
24,2026-02,55254350.87,16642021.56,844,134,30.118934,15.876777

Revenue remains stable with moderate volatility, profit margins are consistently strong around 30%, and return rates fluctuate between 1216% without a clear upward trend. The business appears operationally stable with manageable return-related risk.

Customer Repeat Purchase Analysis

In [64]:
df.head()

,OrderID,OrderDate,CustomerID,Region,Category,Product,Quantity,Price,Cost,Revenue,Profit,Returned,YearMonth
0,1,2025-07-01 11:20:47.314623,1860,South,Sports,Dumbbell,2,22480.29,11577.63,44960.58,21805.32,No,2025-07
1,2,2025-07-05 11:20:47.314623,4772,South,Clothing,Shirt,3,26531.49,20644.41,79594.47,17661.24,No,2025-07
2,3,2025-01-27 11:20:47.314623,4092,West,Electronics,Laptop,3,41385.96,25009.20,124157.88,49130.28,No,2025-01
3,4,2024-08-19 11:20:47.314623,1466,East,Clothing,Shoes,1,20803.90,13609.92,20803.90,7193.98,Yes,2024-08
4,5,2024-03-24 11:20:47.314623,5426,West,Sports,Treadmill,3,11657.87,7263.47,34973.61,13183.20,No,2024-03

In [67]:
customer_order = df.groupby('CustomerID').agg(
    total_order = ('OrderID','count'),
    total_profit = ('Profit','sum'),
    total_revenue = ('Revenue','sum'),
    returned_orders = ('Returned',lambda x:(x=='Yes').sum())
).reset_index()

customer_order

      CustomerID  total_order  total_profit  total_revenue  returned_orders
0           1000            3      38652.82      132423.75                1
1           1001            5      46559.27      157832.41                1
2           1002            5      61727.26      256145.15                0
3           1003            3      31014.29       80761.30                0
4           1004            4      85287.34      285901.01                1
...          ...          ...           ...            ...              ...
4965        5995            5      63206.81      223996.25                2
4966        5996            5     148095.91      403783.81                0
4967        5997            5     146755.26      445716.38                0
4968        5998            4      98186.69      305987.57                1
4969        5999            5      82107.68      277756.43                1

[4970 rows x 5 columns]

In [68]:
customer_order['Customer_Type'] = customer_order['total_order'].apply(lambda x:"Repeat" if x>1 else "One-Time")

customer_order.head()

,CustomerID,total_order,total_profit,total_revenue,returned_orders,Customer_Type
0,1000,3,38652.82,132423.75,1,Repeat
1,1001,5,46559.27,157832.41,1,Repeat
2,1002,5,61727.26,256145.15,0,Repeat
3,1003,3,31014.29,80761.30,0,Repeat
4,1004,4,85287.34,285901.01,1,Repeat

In [70]:
customer_type_summary = customer_order['Customer_Type'].value_counts()

customer_type_summary

Customer_Type
Repeat      4790
One-Time     180
Name: count, dtype: int64

In [73]:
revenue_by_type = customer_order.groupby('Customer_Type').agg(
    Customers = ('CustomerID','count'),
    Total_Revenue = ('total_revenue','sum'),
    Total_Profit = ('total_profit','sum')
).reset_index()

revenue_by_type

  Customer_Type  Customers  Total_Revenue  Total_Profit
0      One-Time        180   1.142027e+07  3.263249e+06
1        Repeat       4790   1.557663e+09  4.688991e+08

In [74]:
revenue_by_type["Total_Revenue"] = revenue_by_type["Total_Revenue"].map('{:,.2f}'.format)
revenue_by_type["Total_Profit"] = revenue_by_type["Total_Profit"].map('{:,.2f}'.format)

revenue_by_type

  Customer_Type  Customers     Total_Revenue    Total_Profit
0      One-Time        180     11,420,268.82    3,263,249.11
1        Repeat       4790  1,557,662,898.62  468,899,066.06

The companys revenue model is heavily dependent on repeat customers, who contribute more than 99% of total revenue. This indicates strong customer retention and loyalty, making repeat buyers the backbone of the business.

Average Order Value & Customer Value Analysis

In [75]:
total_orders = len(df)

total_revenue = df['Revenue'].sum()

aov = total_revenue/total_orders

print(round(aov,2))

62763.33

In [80]:
aov_by_type = customer_order.copy()

In [81]:
aov_by_type

,CustomerID,total_order,total_profit,total_revenue,returned_orders,Customer_Type
0,1000,3,38652.82,132423.75,1,Repeat
1,1001,5,46559.27,157832.41,1,Repeat
2,1002,5,61727.26,256145.15,0,Repeat
3,1003,3,31014.29,80761.30,0,Repeat
4,1004,4,85287.34,285901.01,1,Repeat
...,...,...,...,...,...,...
4965,5995,5,63206.81,223996.25,2,Repeat
4966,5996,5,148095.91,403783.81,0,Repeat
4967,5997,5,146755.26,445716.38,0,Repeat
4968,5998,4,98186.69,305987.57,1,Repeat
4969,5999,5,82107.68,277756.43,1,Repeat

In [84]:
aov_by_type['AOV'] = (
    aov_by_type['total_revenue']/
    aov_by_type['total_order']
)

aov_by_type

,CustomerID,total_order,total_profit,total_revenue,returned_orders,Customer_Type,AOV
0,1000,3,38652.82,132423.75,1,Repeat,44141.250000
1,1001,5,46559.27,157832.41,1,Repeat,31566.482000
2,1002,5,61727.26,256145.15,0,Repeat,51229.030000
3,1003,3,31014.29,80761.30,0,Repeat,26920.433333
4,1004,4,85287.34,285901.01,1,Repeat,71475.252500
...,...,...,...,...,...,...,...
4965,5995,5,63206.81,223996.25,2,Repeat,44799.250000
4966,5996,5,148095.91,403783.81,0,Repeat,80756.762000
4967,5997,5,146755.26,445716.38,0,Repeat,89143.276000
4968,5998,4,98186.69,305987.57,1,Repeat,76496.892500
4969,5999,5,82107.68,277756.43,1,Repeat,55551.286000

In [85]:
aov_by_type.groupby('Customer_Type')['AOV'].mean()

Customer_Type
One-Time    63445.937889
Repeat      62854.249687
Name: AOV, dtype: float64

In [86]:
customer_order.groupby('Customer_Type')['total_revenue'].mean()

Customer_Type
One-Time     63445.937889
Repeat      325190.584263
Name: total_revenue, dtype: float64

Repeat customers do not spend more per order; however, their higher purchase frequency drives significantly greater lifetime revenue, making retention and repeat engagement the primary growth lever.